app/controllers/events_controller.rb

  def index
    @events = Event.find(:all)
---
SELECT * FROM `events` WHERE (dtstart LIKE '2009-02-15%' )

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`event_id` = 4)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`event_id` = 3)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`status`, `completed`, `updated_at`, `creator_id`, `rrule`, `busy`, `timezone`, `dtend`, `summary`, `description`, `version`, `dtstart`, `user_id`, `dtstamp`, `event_type`, `case_id`, `location`, `alarm`, `calendar_id`, `created_at`) VALUES('active', 0, '2009-03-10 14:28:07', 1, NULL, 1, 'SYSTEM', NULL, 'This event is happening!', NULL, 1, '2009-02-08 18:17:23', NULL, '2009-03-10 14:10:11', 'Target', 1, NULL, 'stringy', '1', '2009-03-10 14:28:07')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `events` WHERE (`events`.`event_id` = 10)
UPDATE `events` SET `case_id` = 2, `creator_id` = 1, `updated_at` = '2009-03-11 00:55:30' WHERE `event_id` = 1174

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM `events` WHERE (`events`.`event_id` = 1)
DELETE FROM `events` WHERE `event_id` = 1