app/controllers/tasks_controller.rb

  def index
    @uncompleted_past = Event.find(:all, :conditions => ["(event_type = 'Target' OR
                                                          event_type = 'Deadline')
                                                        AND completed = 0
                                                        AND dtstart < NOW()
                                                      "],
                                        :order => :calendar_id )
---
SELECT * FROM `events` WHERE ((event_type = 'Target' OR

  def show
    @task = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`event_id` = 12)